hugo/public/lunescript/recommend/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>A. トランスコンパイラ開発のすゝめ - 公開技術情報</title>
<meta name="generator" content="Hugo 0.100.1" />
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/lunescript/recommend/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="A. トランスコンパイラ開発のすゝめ" />
<meta property="og:description" content="LuneScript 入門のアドベントカレンダー最後の記事は、 これまでとは趣向を変えてトランスコンパイラ開発そのものについて扱っていきます。 トランスコンパイラ開" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/lunescript/recommend/" /><meta property="article:section" content="LuneScript" />

<meta property="og:site_name" content="公開技術情報" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="A. トランスコンパイラ開発のすゝめ"/>
<meta name="twitter:description" content="LuneScript 入門のアドベントカレンダー最後の記事は、 これまでとは趣向を変えてトランスコンパイラ開発そのものについて扱っていきます。 トランスコンパイラ開"/>
<meta itemprop="name" content="A. トランスコンパイラ開発のすゝめ">
<meta itemprop="description" content="LuneScript 入門のアドベントカレンダー最後の記事は、 これまでとは趣向を変えてトランスコンパイラ開発そのものについて扱っていきます。 トランスコンパイラ開">

<meta itemprop="wordCount" content="4049">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_fengari/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>A. トランスコンパイラ開発のすゝめ</h1>

<p>
LuneScript 入門のアドベントカレンダー最後の記事は、
これまでとは趣向を変えてトランスコンパイラ開発そのものについて扱っていきます。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
トランスコンパイラ開発をすゝめる理由
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
私は LuneScript というトランスコンパイラを開発しています。</p>
<p>
この開発を通して、エンジニアとして良い経験が出来たと感じています。</p>
<p>
なお、LuneScript を開発した理由については次の記事に書いています。</p>
<p>
<a href="../reason">../reason</a></p>
<p>
私は次の理由からトランスコンパイラ開発を
多くの方に経験して欲しいと思い、この記事を書くことにしました。</p>
<ul>
<li>現状に対する不満を建設的に解決できる</li>
<li>トレンドの技術を確認できる</li>
<li>コーディングルールを矯正できる  </li>
</ul>
<p>以降では、上記の各項目を説明していきます。</p>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
現状に対する不満を建設的に解決できる
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
皆さんは、今のソフトウェア開発に対して不満を持っていませんか？</p>
<ul>
<li>上司が気にいらないとか、</li>
<li>開発 PC の性能がショボいとか、</li>
<li>給料が安いとか、</li>
<li>残業が多いとか、</li>
</ul>
<p>私が言っている「不満」は、
上記のソフトウェア開発を取り巻く「現実社会への不満」では <strong>なく</strong> 、</p>
<p>
ソフトウェア開発を行う上で、
頭の中にあるアイデアを実現するのに</p>
<ul>
<li>言語仕様上バグり易いとか、</li>
<li>もの凄く手間のかかる面倒な書き方しか出来ないとか、</li>
<li>実現するために必要なユーティリティ的なものを一から作らなければならず、
本来作りたいものに辿り着く前に時間が掛り過ぎるとか、</li>
<li>そもそも言語仕様的に実現できないとか、</li>
</ul>
<p>そういった、プログラム言語に対する不満です。</p>
<p>
そのような不満がある人で、
その不満を解決するための具体的なアイデアがある人には、
トランスコンパイラを開発することを薦めます。</p>
<p>
私自身、トランスコンパイラを開発しようと思った一番の理由はこのためです。</p>
<p>
「無いなら自分で作れば良い」</p>
<p>
アイデアをソフトウェアで実現出来る能力を持っているからこそ
「ソフトウェアエンジニア」ではないでしょうか？</p>
<div id="outline-container-headline-3" class="outline-4">
<h4 id="headline-3">
「コンパイラ」ではなく「トランスコンパイラ」である理由
</h4>
<div id="outline-text-headline-3" class="outline-text-4">
<p>
『なんで「コンパイラ」じゃなくて「トランスコンパイラ」なの？』
と疑問に思う方もいるかもしれません。</p>
<p>
それは、「トランスコンパイラ」の方が「コンパイラ」を作りよりも
技術的なハードルが低いためです。
LLVM の登場で、以前と比べればコンパイラ開発のハードルは下っているとは思いますが、
それでもトランスコンパイラの方がまだまだハードルは低いです。</p>
<p>
特に、コンパイルした後のコードにバグがあった時の「原因追求コスト」は、
トランスコンパイラの方が圧倒的に低いです。</p>
<p>
コンパイラを作ること自体が目的であればそれでも良いとは思いますが、
コンパイラを作ること自体は手段であり、
あくまでも目的は「プログラム言語に対する不満」を解決することです。</p>
<p>
出来るだけコストを掛けずに実現できる方が良いでしょう。</p>
<p>
それに、「プログラム言語に対する不満」の多くは、
トランスコンパイラで解決できることがほとんどです。</p>
<p>
もちろん「コンパイル時間をもっと短くしたい」というような不満には、
コンパイラを自前で開発しなければならないと思いますが、
それ以外のほとんど不満はトランスコンパイラで解決できるでしょう。</p>
<p>
最終的なゴールが、コンパイラを作ることであったとしても、</p>
<ul>
<li>まずはトランスコンパイラを作成し、</li>
<li>不満を解決できていることや、言語としての使い易さを実証し、</li>
<li>そのトランスコンパイラを使うことが有益であることが確認でき、</li>
<li>その後、直接ネイティブへのコンパイルが必要になってから</li>
</ul>
<p>最終的にコンパイラを開発するのが、効率の良い方法と言えるでしょう。</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-4">
<h4 id="headline-4">
「インタプリタ」ではなく「トランスコンパイラ」である理由
</h4>
<div id="outline-text-headline-4" class="outline-text-4">
<p>
「コンパイラ」ではない理由は上述しました。</p>
<p>
ここでは、「インタプリタ」ではない理由を説明します。</p>
<p>
と、言っても理由は「コンパイラ」の時と変らずに、
「インタプリタ」よりも「ハードルが低い」からです。</p>
<p>
インタプリタを作るのは、コンパイラよりはハードルが低いです。
私自身、簡易的なインタプリタは何度か作った経験があります。</p>
<p>
しかし、実用的なインタプリタとなると話は別です。
実用的なインタプリタとなると、
開発工数的な問題と、実行性能的な問題があります。
コンパイラの時にも書きましたが、
「プログラム言語に対する不満」を解決するのが目的なので、
それ以外のことは一旦考えないでおきましょう。</p>
<p>
今は実用的なインタプリタ型の言語(スクリプト言語)が世の中にいくつもあります。
わざわざ自前で作る必要はないでしょう。</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
出力結果が分かり易い
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<p>
コンパイラと比べてトランスコンパイラの方が良いこととして、
「トランスコンパイラの出力コードは多くの人にとって分かり易い」ことが
挙げられます。</p>
<p>
コンパイラが出力した「ネイティブコード」と、
トランスコンパイラが出力した「とある言語のコード」、
どちらが分かり易いかと言えば、「とある言語のコード」の方が分かり易いのは
誰もが認めるところでしょう。</p>
<p>
「じゃぁなんで分かり易い方が良いんだ？」というと、
導入リスクがそれだけ低いということです。</p>
<p>
新しい技術をプロジェクトに導入する際、
それが「安全」かどうかを判断する必要があります。</p>
<p>
単に「安全」と言っても、色々な観点があります。</p>
<ul>
<li>ウイルス的なものが入り込んでいないことを保証する「情報セキュリティ」</li>
<li>海外に輸出可能か、「外為法」の対象かどうか</li>
<li>ライセンス的に問題ないか。 
そのコンパイラの作者が作成した部分のライセンスは問題なくても、
作者が意図せずに使用しているコードにライセンス上の問題がないか</li>
</ul>
<p>他にも新しいものを導入するには、幾つかの安全性をクリアする必要があります。</p>
<p>
これらの安全性をクリアする際、その対象技術の分かり易さは非常に重要です。</p>
<p>
コンパイラの場合、
生成されたネイティブコードを調べるのは現実的ではないため、
コンパイラのコードを調査して安全性を確認することになります。</p>
<p>
一方トランスコンパイラは、
ライセンスと変換後のコードを調べれば良いだけです。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
トレンドの技術を確認できる
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
せっかく新しいトランスコンパイラを開発するのであれば、
できるだけ使い勝手の良いものを作ろうと思うのがエンジニアの性分でしょう。</p>
<p>
であれば、さまざまな言語の特徴を調査して、
良いものを取り込むのが常套手段です。</p>
<p>
私も LuneScript を開発するにあたり、なるべく多くの言語を調査し、
さまざまな機能を取り込んだつもりです。</p>
<p>
さまざまな言語の特徴を知ることに何の意味があるのか？
例えば普段 C 言語のプロジェクトしか関わりのないエンジニアが
Go や swift の特徴を知ることに意味があるのか？
そのようなことを疑問に思う人もいると思います。</p>
<p>
普段から Qiita 等のサイトで自ら新しい情報を収集しているような人ならば、
そのようなことを疑問に持つことはないと思いますが、
そうでない場合は疑問に思う人は少なくないでしょう。</p>
<p>
私は、例え普段 C 言語のプロジェクトしか関わりのないエンジニアであっても、
イマドキの言語の特徴は把握しておくべきだと思います。</p>
<p>
それは、イマドキの言語の特徴そのものは C 言語では使えないとしても、
考え方や、エッセンスなどは C 言語でも導入可能だからです。</p>
<p>
例えば、関数型言語の考え方自体は、
Haskell を使わなくても C 言語でも実現できます。</p>
<p>
もちろん、C 言語の syntax だと書き難いモノや、
C 言語の仕様上実現できないモノなども存在します。</p>
<p>
しかし、関数型言語の考え方自体を知った上で、敢えて C 言語らしく書くことと、
C 言語しか知らないからいつも通りに C 言語で書くことは、違います。</p>
<p>
また、イマドキの言語の特徴をトランスコンパイラの機能として取り込むには、
単にイマドキの言語を使うよりも、より深い理解が可能になります。
というか深い理解がなければ取り込むことは出来ません。</p>
<p>
このように、イマドキの言語の特徴の理解を深めるためにも
トランスコンパイラの開発は経験として良いものだと言えます。</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
コーディングルールを矯正できる  
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
これは、いままで挙げた内容と少し方向性が違いますが、
自分としては結構重要だと思った点です。</p>
<p>
皆さん、コーディングする際、
「こう書きたい」「こう書くべき」というような理想の書き方を持っていると思います。</p>
<p>
トランスコンパイラを開発するということは、
コーディングルールを言語レベルで矯正(強制)できる、ということでもあります。</p>
<p>
この説明だと「どういうこと？」と疑問に持つ方も多いと思いますが、
python の「インデントによるブロック」と言えば通じると思います。</p>
<p>
python は、
ブロックをキーワードや区切り記号ではなく、インデントによって表現します。</p>
<p>
つまり、「ブロックはインデントすべき」ということを
コーディングルールで縛るのではなく、
Python では「インデントが揃っていないとブロックとして扱わねぇよ」と
言語レベルで矯正(強制)している訳です。</p>
<p>
コーディングルールで論争が起ることは少なくありません。
独自にトランスコンパイラを開発すれば、
言語レベルでそのような無駄な論争を防げます。</p>
<p>
自分でトランスコンパイラを開発するまではあまり意識していませんでしたが、
普段意識しているコーディングルールの中でも、
別の言語では言語レベルで実施できないから不要になっているルールというものが
いくつかあることが分かりました。</p>
<p>
新しい言語を開発する際は、新しい機能を取り入れるだけでなく、
普段のコーディングルールを見直し、言語レベルで対応できないか検討するべきだと思います。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
最後に
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>
これまでに、
簡易的なインタプリタや、<a href="../../lctags/">ソースコードタグシステム</a> 等を趣味で作ってきました。</p>
<p>
今回 LuneScript 開発を通して、
また一つソフトウェア開発の面白さを実感できました。</p>
<p>
「いまさら新しい言語なんて作っても意味はない」、
そう思っている方も多いと思います。少なくとも私はそう思っていました。</p>
<p>
しかし、今回 LuneScript を開発することで、
また一つソフトウェアエンジニアとして成長出来たと思います。</p>
<p>
人がどう思おうが自分で成長を感じることが出来れば、それが一番です。</p>
<p>
ソフトウェア開発に対して不満を持っている方は、
是非新しいプログラミング言語の開発にチャレンジしてみてください。</p>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/lunescript/onweb/" title="A. Web ブラウザ上で動作する LuneScript"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - A. Web ブラウザ上で動作する LuneScript</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/lunescript/completion/" title="A.イマドキな開発環境でもっと楽しよう">Next - A.イマドキな開発環境でもっと楽しよう <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/javascript/thread/">JavaScript のスレッド(非同期処理)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class="active"><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design/">Y.1 LuneScript の開発方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
